In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('summer.csv')

In [3]:
df.head()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold
4,1896,Athens,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver

In [4]:
df.tail()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
31160,2012,London,Wrestling,Wrestling Freestyle,"JANIKOWSKI, Damian",POL,Men,Wg 84 KG,Bronze
31161,2012,London,Wrestling,Wrestling Freestyle,"REZAEI, Ghasem Gholamreza",IRI,Men,Wg 96 KG,Gold
31162,2012,London,Wrestling,Wrestling Freestyle,"TOTROV, Rustam",RUS,Men,Wg 96 KG,Silver
31163,2012,London,Wrestling,Wrestling Freestyle,"ALEKSANYAN, Artur",ARM,Men,Wg 96 KG,Bronze
31164,2012,London,Wrestling,Wrestling Freestyle,"LIDBERG, Jimmy",SWE,Men,Wg 96 KG,Bronze

In [5]:
df.shape

(31165, 9)

In [6]:
df.columns

Index(['Year', 'City', 'Sport', 'Discipline', 'Athlete', 'Country', 'Gender',
       'Event', 'Medal'],
      dtype='object')

In [7]:
pd.value_counts(df['Gender'])

Men      22746
Women     8419
Name: Gender, dtype: int64

In [9]:
pd.value_counts(df['Sport']).head()

Aquatics      4170
Athletics     3638
Rowing        2667
Gymnastics    2307
Fencing       1613
Name: Sport, dtype: int64

In [10]:
# find out the male athelete with highest number of medals...
# find out the female athelete with highest number of medals...

In [21]:
df.groupby('Gender')['Athlete'].value_counts()

Gender  Athlete
Men     PHELPS, Michael         22
        ANDRIANOV, Nikolay      15
        MANGIAROTTI, Edoardo    13
        ONO, Takashi            13
        SHAKHLIN, Boris         13
                                ..
Women   ZURRER, Emily Jane       1
        ZVEREVA, Natalya         1
        ZVONAREVA, Vera          1
        ZWEHL, Julia             1
        ZWIERS, Claudia          1
Name: Athlete, Length: 22767, dtype: int64

In [33]:
men_data = df[df['Gender'] == 'Men']
women_data = df[df['Gender'] == 'Women']

In [34]:
men_data.shape

(22746, 9)

In [35]:
women_data.shape

(8419, 9)

In [36]:
pd.value_counts(men_data['Athlete']).head(1)

Michael Phelps    22
Name: Athlete, dtype: int64

In [37]:
pd.value_counts(women_data['Athlete']).head(1)

Larisa Latynina    18
Name: Athlete, dtype: int64

In [38]:
df['Athlete'].str.split(", ").head()

0         [Alfred Hajos]
1      [Otto Herschmann]
2     [Dimitrios Drivas]
3    [Ioannis Malokinis]
4    [Spiridon Chasapis]
Name: Athlete, dtype: object

In [39]:
df['Athlete'].str.split(", ").str[::-1].head()

0         [Alfred Hajos]
1      [Otto Herschmann]
2     [Dimitrios Drivas]
3    [Ioannis Malokinis]
4    [Spiridon Chasapis]
Name: Athlete, dtype: object

In [40]:
df['Athlete'] = df['Athlete'].str.split(", ").str[::-1].str.join(" ").str.title()

In [41]:
df.head()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,Alfred Hajos,HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,Otto Herschmann,AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,Dimitrios Drivas,GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,Ioannis Malokinis,GRE,Men,100M Freestyle For Sailors,Gold
4,1896,Athens,Aquatics,Swimming,Spiridon Chasapis,GRE,Men,100M Freestyle For Sailors,Silver

In [44]:
men_data.groupby('Athlete')['Medal'].count()

Athlete
- Johnson             2
..... Daumain         1
A. Albert             1
A. B. Zumelzu         1
A. Bögli              1
                     ..
Ödön Tersztyanszky    3
Ödön Tery             1
Ödön Zombori          2
Öistein Schirmer      1
Östen Östensen        5
Name: Medal, Length: 16927, dtype: int64

In [46]:
men_data.groupby('Athlete')['Medal'].count().reset_index().head()

         Athlete  Medal
0      - Johnson      2
1  ..... Daumain      1
2      A. Albert      1
3  A. B. Zumelzu      1
4       A. Bögli      1

In [47]:
men_data.groupby(['Athlete','Medal'])['Sport'].count().reset_index().head()

         Athlete   Medal  Sport
0      - Johnson  Bronze      1
1      - Johnson    Gold      1
2  ..... Daumain  Bronze      1
3      A. Albert    Gold      1
4  A. B. Zumelzu  Silver      1

In [48]:
men_data.groupby(['Athlete','Medal'])['Sport'].count().reset_index().sort_values(by='Sport', ascending = False).head()

              Athlete Medal  Sport
12806  Michael Phelps  Gold     18
2675       Carl Lewis  Gold      9
12271      Mark Spitz  Gold      9
14059     Paavo Nurmi  Gold      9
16242      Sawao Kato  Gold      8

In [51]:
df_2 = men_data.groupby(['Athlete','Medal'])['Sport'].count().reset_index().sort_values(by='Sport', ascending = False)

In [52]:
df_2.drop_duplicates('Medal')

                  Athlete   Medal  Sport
12806      Michael Phelps    Gold     18
773          Alexei Nemov  Bronze      6
507    Aleksandr Dityatin  Silver      6

In [53]:
df_2.drop_duplicates('Medal', keep='last')

                          Athlete   Medal  Sport
7022                 Günter Lörke  Silver      1
7013                Gösta Löfgren  Bronze      1
9869  Jonathan Nicholas M. Potter    Gold      1